Repository: Spacebody/Vela
Catalog: Vela/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# accessibility.configurationEditor
source: Configuration editor
zh_hans: 配置编辑器

# accessibility.helpFor
source: Help for %@
zh_hans: %@的帮助

# app.bootstrap.failure.action
source: Check Application Support permissions and relaunch Vela.
zh_hans: 请检查“应用程序支持”目录权限，然后重新启动 Vela。

# app.bootstrap.failure.message
source: The application environment could not be created.
zh_hans: 无法创建应用环境。

# app.bootstrap.failure.title
source: Vela could not start
zh_hans: Vela 无法启动

# app.help.open
source: Vela Help
zh_hans: Vela 帮助

# app.quit.cleanup.cancel
source: Cancel Quit
zh_hans: 取消退出

# app.quit.cleanup.confirm
source: Quit Anyway
zh_hans: 仍然退出

# app.quit.cleanup.message
source: Vela could not confirm that its proxy runtime was fully cleaned up. Cancel quitting to review Diagnostics and retry cleanup, or quit anyway. If System Proxy was active, verify the macOS network proxy settings after quitting.
zh_hans: Vela 无法确认代理运行时已完全清理。取消退出可打开“诊断”并重试清理；也可以仍然退出。如果之前启用了系统代理，请在退出后检查 macOS 网络代理设置。

# app.quit.cleanup.title
source: Proxy Cleanup Did Not Finish
zh_hans: 代理清理未完成

# beta.build.audit
source: Audit Evidence
zh_hans: 审计证据

# beta.build.audit.value
source: See the build identity for protected release evidence availability.
zh_hans: 请根据构建身份确认受保护发布证据是否可用。

# beta.build.channel
source: Build Channel
zh_hans: 构建通道

# beta.build.label
source: Build
zh_hans: 构建

# beta.build.provenance
source: Provenance
zh_hans: 来源证明

# beta.build.provenance.value
source: Validated bundled release manifest and dependency digest
zh_hans: 已验证的内置发布清单与依赖摘要

# beta.evidence.clear
source: Clear Local Evidence
zh_hans: 清除本地证据

# beta.evidence.clear.action
source: Clear Evidence
zh_hans: 清除证据

# beta.evidence.clear.confirmation.message
source: This removes the local reliability ledger and quarantined evidence. It does not change profiles, configuration, or network state.
zh_hans: 这会移除本地可靠性账本及隔离的异常证据，不会更改配置档、配置或网络状态。

# beta.evidence.clear.confirmation.title
source: Clear Local Reliability Evidence?
zh_hans: 清除本地可靠性证据？

# beta.evidence.diagnostics.privacy
source: This bounded ledger is local-only and contains stable result codes and counters, not URLs, profile names, paths, secrets, or raw errors.
zh_hans: 此有界账本仅保存在本机，只包含稳定结果代码与计数，不包含 URL、配置档名称、路径、密钥或原始错误。

# beta.evidence.diagnostics.section
source: Reliability Evidence
zh_hans: 可靠性证据

# beta.evidence.events
source: Retained Events
zh_hans: 保留的事件

# beta.evidence.export
source: Export Redacted Evidence
zh_hans: 导出已脱敏证据

# beta.evidence.export.failed
source: The redacted reliability evidence could not be exported.
zh_hans: 无法导出已脱敏的可靠性证据。

# beta.evidence.failures
source: Failure Events
zh_hans: 失败事件

# beta.evidence.recording
source: Record bounded local evidence
zh_hans: 记录有界的本地证据

# beta.evidence.refresh
source: Refresh Evidence
zh_hans: 刷新证据

# beta.evidence.retention
source: Retention
zh_hans: 保留期限

# beta.evidence.retention.value
source: Up to 30 days or 5,000 events
zh_hans: 最多 30 天或 5,000 个事件

# beta.evidence.section
source: Local Reliability Evidence
zh_hans: 本地可靠性证据

# beta.evidence.unavailable.title
source: Evidence Unavailable
zh_hans: 证据不可用

# beta.knownIssues.name
source: Known Issues
zh_hans: 已知问题

# beta.knownIssues.open
source: Open Known Issues
zh_hans: 打开已知问题

# beta.knownIssues.unavailable
source: The known issues page is unavailable.
zh_hans: 已知问题页面不可用。

# beta.localOnly.notice
source: Reliability evidence stays on this Mac. Vela does not automatically upload crashes, traces, logs, hardware details, or usage behavior.
zh_hans: 可靠性证据只保留在这台 Mac 上。Vela 不会自动上传崩溃、跟踪、日志、硬件详情或使用行为。

# beta.safeMode.active
source: Read-only Safe Mode
zh_hans: 只读安全模式

# beta.safeMode.cancelRequest
source: Cancel Safe Mode on Next Launch
zh_hans: 取消下次启动的安全模式

# beta.safeMode.description
source: Safe Mode uses the Factory Core, keeps network mutations off, disables automatic updates and scenes, and preserves existing stores for recovery.
zh_hans: 安全模式使用出厂内核、关闭网络变更、停用自动更新与场景，并保留现有存储以便恢复。

# beta.safeMode.diagnostics.detail
source: Automatic mutations are disabled. Diagnostics, Help, and local support export remain available.
zh_hans: 自动变更已停用。诊断、帮助和本地支持导出仍可使用。

# beta.safeMode.incompleteLaunches
source: Recent Incomplete Launches
zh_hans: 最近未完成的启动

# beta.safeMode.normal
source: Normal
zh_hans: 正常

# beta.safeMode.reason
source: Reason
zh_hans: 原因

# beta.safeMode.reason.coreRecovery
source: Core recovery
zh_hans: 内核恢复

# beta.safeMode.reason.explicit
source: Explicit launch option
zh_hans: 显式启动选项

# beta.safeMode.reason.healthUnavailable
source: Launch health unavailable
zh_hans: 启动健康状态不可用

# beta.safeMode.reason.launchFailure
source: Repeated incomplete launches
zh_hans: 连续未完成启动

# beta.safeMode.reason.migration
source: Migration recovery
zh_hans: 迁移恢复

# beta.safeMode.reason.updateRecovery
source: Update recovery
zh_hans: 更新恢复

# beta.safeMode.reason.user
source: User requested
zh_hans: 用户请求

# beta.safeMode.request
source: Use Safe Mode on Next Launch
zh_hans: 下次启动使用安全模式

# beta.safeMode.section
source: Safe Mode & Recovery
zh_hans: 安全模式与恢复

# beta.safeMode.status
source: Status
zh_hans: 状态

# beta.section.status
source: Public Beta Status
zh_hans: 公开 Beta 状态

# beta.selfTest.check.configuration
source: Configuration Compile
zh_hans: 配置编译

# beta.selfTest.check.controller
source: Controller
zh_hans: 控制器

# beta.selfTest.check.diagnostics
source: Diagnostics
zh_hans: 诊断

# beta.selfTest.check.extendedHost
source: Dedicated Extended-Test Host
zh_hans: 专用扩展测试主机

# beta.selfTest.check.help
source: Help & Search
zh_hans: 帮助与搜索

# beta.selfTest.check.helper
source: Privileged Component Handshake
zh_hans: 特权组件握手

# beta.selfTest.check.manifests
source: Manifests
zh_hans: 清单

# beta.selfTest.check.redaction
source: Support Redaction
zh_hans: 支持信息脱敏

# beta.selfTest.check.signatures
source: Signatures
zh_hans: 签名

# beta.selfTest.check.stores
source: Stores & Journals
zh_hans: 存储与事务日志

# beta.selfTest.extended.action
source: Extended Self-Test…
zh_hans: 扩展自检…

# beta.selfTest.extended.confirmation.action
source: Continue on Dedicated Test Host
zh_hans: 在专用测试主机上继续

# beta.selfTest.extended.confirmation.message
source: Extended tests can change System Proxy and TUN state. Connect power, save your work, and use the opt-in DEBUG hardening harness on a dedicated host.
zh_hans: 扩展测试可能更改系统代理和 TUN 状态。请连接电源、保存工作，并在专用主机上使用显式启用的 DEBUG 加固测试工具。

# beta.selfTest.extended.confirmation.title
source: Run Extended Self-Test?
zh_hans: 运行扩展自检？

# beta.selfTest.outcome.failed
source: Failed
zh_hans: 失败

# beta.selfTest.outcome.passed
source: Passed
zh_hans: 通过

# beta.selfTest.outcome.warning
source: Review
zh_hans: 需检查

# beta.selfTest.quick.action
source: Run Quick Self-Test
zh_hans: 运行快速自检

# beta.selfTest.quick.description
source: Quick self-test checks signatures, manifests, configuration, local stores, diagnostics, Help search, and Support redaction without changing TUN or System Proxy state.
zh_hans: 快速自检会检查签名、清单、配置、本地存储、诊断、帮助搜索和支持信息脱敏，不会更改 TUN 或系统代理状态。

# beta.selfTest.running
source: Running non-destructive checks…
zh_hans: 正在运行非破坏性检查…

# beta.selfTest.section
source: Beta Self-Test
zh_hans: Beta 自检

# beta.selfTest.summary.completed
source: Self-test completed without a blocking failure.
zh_hans: 自检完成，未发现阻断性失败。

# beta.selfTest.summary.failed
source: Self-test completed with checks that need attention.
zh_hans: 自检完成，有检查项需要处理。

# beta.selfTest.summary.title
source: Self-Test Result
zh_hans: 自检结果

# beta.settings.open
source: Open Beta Settings
zh_hans: 打开 Beta 设置

# beta.stable.badge
source: Stable
zh_hans: 稳定版

# beta.support.section
source: Beta Support
zh_hans: Beta 支持

# beta.supportPolicy.open
source: View Beta Support Policy
zh_hans: 查看 Beta 支持政策

# common.cancel
source: Cancel
zh_hans: 取消

# common.dismiss
source: Dismiss
zh_hans: 关闭

# common.done
source: Done
zh_hans: 完成

# common.learnMore
source: Learn More
zh_hans: 了解更多

# common.ok
source: OK
zh_hans: 好

# configuration.applyChanges
source: Apply Changes
zh_hans: 应用更改

# configuration.applyChanges.disabled
source: Resolve validation issues before applying this draft.
zh_hans: 请先解决验证问题，再应用此草稿。

# configuration.applyChanges.help
source: Validate and apply the current draft.
zh_hans: 验证并应用当前草稿。

# configuration.diff.empty.description
source: The draft matches the committed profile overrides.
zh_hans: 草稿与已提交的配置覆盖一致。

# configuration.diff.empty.title
source: No Draft Differences
zh_hans: 草稿没有差异

# configuration.empty.add.action
source: Add Configuration…
zh_hans: 添加配置…

# configuration.empty.catalog.title
source: No Configuration Files
zh_hans: 没有配置文件

# configuration.empty.choose.action
source: Choose Configuration…
zh_hans: 选择配置…

# configuration.empty.noProfile.description
source: Choose a configuration file, then edit, inspect, and apply the runtime configuration.
zh_hans: 请选择一个配置文件，然后编辑、检查并应用运行时配置。

# configuration.empty.noProfile.title
source: No Configuration Selected
zh_hans: 未选择配置文件

# configuration.empty.openProfiles.action
source: Open Configuration Page
zh_hans: 打开配置页面

# configuration.export.error.prepare
source: Vela could not prepare a runnable configuration for export.
zh_hans: Vela 无法准备可供导出的可运行配置。

# configuration.export.error.title
source: Export Failed
zh_hans: 导出失败

# configuration.export.error.write
source: Vela could not write the configuration to the selected location.
zh_hans: Vela 无法将配置写入所选位置。

# configuration.export.title
source: Export Configuration
zh_hans: 导出配置

# configuration.inspector.applyProgress
source: Apply Progress
zh_hans: 应用进度

# configuration.inspector.building.detail
source: Validation and provenance will appear here
zh_hans: 验证和来源信息将在此处显示

# configuration.inspector.building.title
source: Building preview…
zh_hans: 正在生成预览…

# configuration.inspector.capability
source: Capability
zh_hans: 能力

# configuration.inspector.changeDetails
source: Change Details
zh_hans: 更改详情

# configuration.inspector.chooseContext
source: Select a layer, change, rule, or diagnostic.
zh_hans: 选择配置层、更改、规则或诊断项。

# configuration.inspector.committedState
source: Committed state
zh_hans: 已提交状态

# configuration.inspector.committedValue
source: Committed
zh_hans: 已提交

# configuration.inspector.confidence
source: Confidence
zh_hans: 可信度

# configuration.inspector.currentPreview
source: Current preview
zh_hans: 当前预览

# configuration.inspector.diagnostic
source: Diagnostic
zh_hans: 诊断

# configuration.inspector.diff.operation.add
source: ADD
zh_hans: 新增

# configuration.inspector.diff.operation.change
source: CHANGE
zh_hans: 更改

# configuration.inspector.diff.operation.remove
source: REMOVE
zh_hans: 移除

# configuration.inspector.diff.source.forced
source: Vela Required
zh_hans: Vela 必需项

# configuration.inspector.diff.source.override
source: Vela Override
zh_hans: Vela 覆盖

# configuration.inspector.diff.source.upstream
source: Upstream
zh_hans: 上游

# configuration.inspector.draftState
source: Draft
zh_hans: 草稿

# configuration.inspector.draftValue
source: Draft / Effective
zh_hans: 草稿 / 有效值

# configuration.inspector.effective.title
source: Effective Configuration
zh_hans: 有效配置

# configuration.inspector.failure
source: Configuration Unavailable
zh_hans: 配置不可用

# configuration.inspector.invalid.title
source: Configuration Invalid
zh_hans: 配置无效

# configuration.inspector.layer
source: Layer
zh_hans: 配置层

# configuration.inspector.loading.description
source: Selection will be available with the new snapshot.
zh_hans: 新快照生成后即可选择。

# configuration.inspector.message
source: Message
zh_hans: 信息

# configuration.inspector.name
source: Name
zh_hans: 名称

# configuration.inspector.noProfile.description
source: Select a profile to inspect validation, semantic diff, and source values.
zh_hans: 请选择配置文件以检查验证结果、语义差异和值来源。

# configuration.inspector.noSelection
source: No Selection
zh_hans: 未选择

# configuration.inspector.operation
source: Operation
zh_hans: 操作

# configuration.inspector.path
source: Path
zh_hans: 路径

# configuration.inspector.phase
source: Phase
zh_hans: 阶段

# configuration.inspector.preserved
source: Preserved
zh_hans: 已保留

# configuration.inspector.raw.title
source: Raw Configuration
zh_hans: 原始配置

# configuration.inspector.recovery
source: Recovery Evidence
zh_hans: 恢复证据

# configuration.inspector.rule
source: Rule
zh_hans: 规则

# configuration.inspector.ruleSource
source: Rule Source
zh_hans: 规则来源

# configuration.inspector.runtimeIndex
source: Runtime index
zh_hans: 运行时索引

# configuration.inspector.section.diff
source: Diff
zh_hans: 差异

# configuration.inspector.section.preview
source: Preview
zh_hans: 预览

# configuration.inspector.section.validation
source: Validation
zh_hans: 验证

# configuration.inspector.source
source: Source
zh_hans: 来源

# configuration.inspector.sourceEffective
source: Source & Effective Value
zh_hans: 来源与有效值

# configuration.inspector.state
source: State
zh_hans: 状态

# configuration.inspector.subtitle
source: Validation, provenance, and redacted output
zh_hans: 验证、来源和脱敏输出

# configuration.inspector.title
source: Source Inspector
zh_hans: 来源检查器

# configuration.inspector.unchangedUntilVerified
source: Unchanged until verified
zh_hans: 验证前保持不变

# configuration.inspector.validation.valid
source: Structured overrides are valid
zh_hans: 结构化覆盖有效

# configuration.inspector.values
source: Source & Effective Value
zh_hans: 来源与有效值

# configuration.inspector.yaml.effective
source: Effective
zh_hans: 有效

# configuration.inspector.yaml.raw
source: Raw
zh_hans: 原始

# configuration.layer.effective
source: Effective Runtime Config
zh_hans: 有效运行时配置

# configuration.layer.effective.subtitle
source: Read-only compiled result after all available layers
zh_hans: 所有可用层应用后的只读编译结果

# configuration.layer.operationCount
source: %lld operations · %@
zh_hans: %lld 项操作 · %@

# configuration.layer.overrides
source: Profile Overrides
zh_hans: 配置覆盖

# configuration.layer.runtimeSafety
source: Runtime Safety
zh_hans: 运行时安全

# configuration.layer.runtimeSafety.detail
source: Read only · protected
zh_hans: 只读 · 受保护

# configuration.layer.upstream
source: Upstream Profile
zh_hans: 上游配置

# configuration.layer.upstream.subtitle
source: Read-only source before structured overrides
zh_hans: 应用结构化覆盖前的只读来源

# configuration.mode.diff
source: Diff
zh_hans: 差异

# configuration.mode.editor
source: Editor
zh_hans: 编辑器

# configuration.mode.effective
source: Effective
zh_hans: 有效配置

# configuration.mode.rules
source: Rules
zh_hans: 规则

# configuration.mode.title
source: Work Area
zh_hans: 工作区

# configuration.moreActions
source: More Actions
zh_hans: 更多操作

# configuration.navigator.selectedProfile
source: Selected profile compilation
zh_hans: 所选配置文件的编译结果

# configuration.navigator.selectProfile
source: Select a profile to begin
zh_hans: 选择配置文件以开始

# configuration.navigator.title
source: Layers
zh_hans: 配置层

# configuration.override.inherit
source: Inherit
zh_hans: 继承

# configuration.override.off
source: Off
zh_hans: 关闭

# configuration.override.on
source: On
zh_hans: 开启

# configuration.override.remove
source: Remove
zh_hans: 移除

# configuration.override.set
source: Override
zh_hans: 覆盖

# configuration.preview.compiling.detail
source: Building a redacted preview
zh_hans: 正在生成脱敏预览

# configuration.preview.compiling.title
source: Compiling configuration
zh_hans: 正在编译配置

# configuration.preview.unavailable.description
source: Resolve validation errors before inspecting this layer.
zh_hans: 请先解决验证错误，再检查此层。

# configuration.preview.unavailable.title
source: Preview unavailable
zh_hans: 预览不可用

# configuration.profileMenu.accessibilityLabel
source: Configuration
zh_hans: 配置

# configuration.remoteEditor.content
source: Configuration Content
zh_hans: 配置内容

# configuration.remoteEditor.subscription
source: Subscription Settings
zh_hans: 订阅设置

# configuration.rules.append
source: Append · Vela-owned
zh_hans: 追加 · Vela 所有

# configuration.rules.effective
source: Effective Runtime Order
zh_hans: 有效运行时顺序

# configuration.rules.empty
source: No rules in this segment
zh_hans: 此分段没有规则

# configuration.rules.noOwnedAppend
source: No owned append rules
zh_hans: 没有 Vela 所有的追加规则

# configuration.rules.noOwnedPrepend
source: No owned prepend rules
zh_hans: 没有 Vela 所有的前置规则

# configuration.rules.prepend
source: Prepend · Vela-owned
zh_hans: 前置 · Vela 所有

# configuration.rules.upstream
source: Upstream · Read only
zh_hans: 上游 · 只读

# configuration.runtimeSafety.protectedReason
source: Vela-owned protected runtime value
zh_hans: Vela 所有的受保护运行时值

# configuration.runtimeSafety.subtitle
source: Protected values enforced by Vela at runtime
zh_hans: Vela 在运行时强制执行的受保护值

# configuration.search.close
source: Close Search
zh_hans: 关闭搜索

# configuration.searchPath
source: Search Path
zh_hans: 搜索路径

# configuration.searchPath.placeholder
source: Path, rule, or value
zh_hans: 路径、规则或值

# configuration.section.sniffer
source: Sniffer
zh_hans: 嗅探

# configuration.status.applying
source: Applying
zh_hans: 正在应用

# configuration.status.clean
source: Clean
zh_hans: 无更改

# configuration.status.compiling
source: Compiling
zh_hans: 正在编译

# configuration.status.draft
source: Draft
zh_hans: 草稿

# configuration.status.draft.count
source: Draft · %lld changes
zh_hans: 草稿 · %lld 项更改

# configuration.status.editable
source: Editable draft
zh_hans: 可编辑草稿

# configuration.status.invalid
source: Invalid
zh_hans: 无效

# configuration.status.invalid.count
source: Invalid · %lld issues
zh_hans: 无效 · %lld 个问题

# configuration.status.loading
source: Loading…
zh_hans: 正在加载…

# configuration.status.noProfile
source: No Profile
zh_hans: 没有配置

# configuration.status.protected
source: Protected
zh_hans: 受保护

# configuration.status.readOnly
source: Read only
zh_hans: 只读

# configuration.status.readyToApply
source: Ready to Apply
zh_hans: 可应用

# configuration.status.recoveryRequired
source: Recovery Required
zh_hans: 需要恢复

# configuration.status.stale
source: Stale
zh_hans: 已过期

# configuration.status.unavailable
source: Unavailable
zh_hans: 不可用

# configuration.status.valid
source: Valid
zh_hans: 有效

# configuration.structuredEditor.section
source: Override Section
zh_hans: 覆盖项

# configuration.validation.accessibilityLabel
source: Validation Status
zh_hans: 验证状态

# configuration.validation.issues.count
source: %lld Issues
zh_hans: %lld 个问题

# configuration.validation.unvalidated
source: Not Validated
zh_hans: 未校验

# configuration.validation.validated
source: Validated
zh_hans: 已校验

# configuration.validation.validating
source: Validating…
zh_hans: 正在校验…

# configuration.workbench.title
source: Configuration Workbench
zh_hans: 配置工作台

# connections.accessibility.columnsFormat
source: Connections %@ columns
zh_hans: 连接 %@ 列布局

# connections.accessibility.pendingMutation
source: Pending connection target and phase
zh_hans: 待处理连接目标和阶段

# connections.accessibility.reconnectAttemptCount
source: Reconnect request count
zh_hans: 重新连接请求计数

# connections.accessibility.selectedInspector
source: Selected connection inspector
zh_hans: 已选连接检查器

# connections.action.closeAll.disabled
source: Available only when active connections can be safely disconnected.
zh_hans: 仅在存在可安全断开的活动连接时可用。

# connections.action.closeAll.hint
source: Disconnect every active connection.
zh_hans: 断开所有活动连接。

# connections.action.openDiagnostics.hint
source: Open guided checks for the disconnected Controller.
zh_hans: 打开针对 Controller 断开的引导检查。

# connections.action.pause.disabled.offline
source: Unavailable while the Controller is disconnected.
zh_hans: Controller 断开时不可用。

# connections.action.pause.hint
source: Pause live connection table updates.
zh_hans: 暂停连接表的实时更新。

# connections.action.reconnect.hint
source: Request a new connection snapshot from the Controller.
zh_hans: 向 Controller 请求新的连接快照。

# connections.action.reconnecting
source: Reconnecting…
zh_hans: 正在重连…

# connections.action.resume.hint
source: Resume live connection table updates.
zh_hans: 恢复连接表的实时更新。

# connections.autoRefresh
source: Auto Refresh
zh_hans: 自动刷新

# connections.column.application
source: Application / Destination
zh_hans: 应用 / 目标

# connections.column.destination
source: Destination
zh_hans: 目标

# connections.column.destinationIP
source: Destination IP
zh_hans: 目标 IP

# connections.column.process
source: Process
zh_hans: 进程

# connections.column.status
source: Status
zh_hans: 状态

# connections.countFormat
source: %lld connections
zh_hans: %lld 个连接

# connections.empty.filtered.description
source: Adjust the search or clear filters to show the current connection snapshot.
zh_hans: 调整搜索条件或清除筛选，以显示当前连接快照。

# connections.empty.filtered.title
source: No Matching Connections
zh_hans: 没有匹配的连接

# connections.empty.live.description
source: The live table is ready. New connections will appear automatically.
zh_hans: 实时表格已就绪，新连接会自动显示。

# connections.empty.live.title
source: No Active Connections
zh_hans: 没有活动连接

# connections.empty.offline.description
source: The table and inspector remain ready. Start Mihomo or refresh after the controller reconnects.
zh_hans: 表格和检查器仍可使用。请启动 Mihomo，或在 Controller 重新连接后刷新。

# connections.empty.offline.title
source: Controller Disconnected
zh_hans: Controller 已断开

# connections.error.closeAllFailed
source: Mihomo did not confirm that all connections were disconnected.
zh_hans: Mihomo 未确认所有连接均已断开。

# connections.error.closeConfirmationTimedOut
source: The disconnect request completed, but confirmation timed out. Refresh to verify the result.
zh_hans: 断开连接请求已完成，但确认超时。请刷新以验证结果。

# connections.error.closeFailed
source: The selected connection could not be disconnected.
zh_hans: 无法断开所选连接。

# connections.error.invalidControllerURL
source: The Controller connections URL is invalid.
zh_hans: Controller 连接 URL 无效。

# connections.error.snapshotDecodeFailed
source: Mihomo returned a connections snapshot Vela could not read.
zh_hans: Mihomo 返回的连接快照无法由 Vela 读取。

# connections.error.streamUnavailable
source: The live stream is unavailable. Refresh after the Controller reconnects.
zh_hans: 实时流不可用。请在 Controller 重新连接后刷新。

# connections.error.title
source: Connections Unavailable
zh_hans: 连接不可用

# connections.filter.blocked
source: Blocked
zh_hans: 已阻止

# connections.filter.label
source: Filter
zh_hans: 筛选

# connections.filter.network
source: Network
zh_hans: 网络

# connections.filter.process
source: Process
zh_hans: 进程

# connections.filter.quick
source: Connection type
zh_hans: 连接类型

# connections.filter.rule
source: Rule
zh_hans: 规则

# connections.inspector.actions.title
source: Actions
zh_hans: 操作

# connections.inspector.closeConnection
source: Close Connection
zh_hans: 关闭连接

# connections.inspector.copyRedactedSummary
source: Copy Redacted Summary
zh_hans: 复制脱敏摘要

# connections.inspector.empty.noData.description
source: Connection summary and route evidence will appear here when data becomes available.
zh_hans: 数据可用后，此处将显示连接摘要和路由证据。

# connections.inspector.empty.selection.description
source: Select a row to inspect endpoints, transfer totals, and why Mihomo chose its route.
zh_hans: 选择一行，以检查端点、传输总量以及 Mihomo 选择此路由的原因。

# connections.inspector.empty.title
source: Connection Inspector
zh_hans: 连接检查器

# connections.inspector.field.destination
source: Destination
zh_hans: 目标

# connections.inspector.field.finalOutbound
source: Final Outbound
zh_hans: 最终出口

# connections.inspector.field.inbound
source: Inbound
zh_hans: 入站

# connections.inspector.field.process
source: Process
zh_hans: 进程

# connections.inspector.field.processPath
source: Process Path
zh_hans: 进程路径

# connections.inspector.field.protocol
source: Protocol
zh_hans: 协议

# connections.inspector.field.providerChain
source: Provider Chain
zh_hans: 供应商链

# connections.inspector.field.proxy
source: Selected Proxy
zh_hans: 已选代理

# connections.inspector.field.proxyChain
source: Proxy Chain
zh_hans: 代理链

# connections.inspector.field.rule
source: Rule
zh_hans: 规则

# connections.inspector.field.ruleIndex
source: Runtime Rule Index
zh_hans: 运行时规则索引

# connections.inspector.field.rulePayload
source: Rule Payload
zh_hans: 规则载荷
